Revit 2027 API
RebarReinforcementData.Create Method
 Creates a new instance of RebarReinforcementData, or null if the operation fails.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RebarReinforcementData Create(
	ElementId rebarId,
	int iEnd
)
Public Shared Function Create (
	rebarId As ElementId,
	iEnd As Integer
) As RebarReinforcementData
public:
static RebarReinforcementData^ Create(
	ElementId^ rebarId,
	int iEnd
)
static member Create :
        rebarId : ElementId *
        iEnd : int -> RebarReinforcementData
Parameters
rebarId ElementId
 the Id of the rebar
iEnd Int32
 The end of rebar where the coupler stays. This should be 0 or 1
Return Value
RebarReinforcementData
 Creates a new instance of RebarReinforcementData
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace